Tekla.Structures.Dialog.FilteredListBox
Represents a control to display a filtered list of items.

Tekla.Structures.Dialog.FilteredListBox.#ctor
Initializes a new instance of the FilteredListBox class.

Tekla.Structures.Dialog.FilteredListBox.Items
Gets or sets the items of the FilteredListBox.

Tekla.Structures.Dialog.FilteredListBox.SelectedItem
Gets or sets the currently selected item in the FilteredListBox.

Tekla.Structures.Dialog.FilteredListBox.ItemSelectionDone
Occurs when the item selection is done.